<a href="https://colab.research.google.com/github/akheel143/SQL/blob/main/1_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Creat a Database**

Syntax:

CREATE DATABASES database_name

```
# ex:CREAT DATABASE employee
```

**Create Table in the Database**

Syntax:

CREATE TABLE table_name(
    
    column_name1 data_type [NULL|NOT NULL,
    
    column_name2 data_type [NULL|NOT NULL,
    
    ...

);
Example:

```
# CREATE TABLE Employee(
    EmpId integer, 
    FirstName varchar(20), 
    LastName varchar(20), 
    Email varchar(25), 
    PhoneNo varchar(25), 
    Salary integer
);
```

1.Create Table with Primary Key

```
# CREATE TABLE Employee (
    EmpId integer PRIMARY KEY, 
    FirstName varchar(20), 
    LastName varchar(20), 
    Email varchar(25), 
    PhoneNo varchar(25), 
    Salary integer
);
```

2.Create New Table from Existing Table

```
# CREATE TABLE Employee_Backup AS SELECT * FROM Employee;
```

3.Create a Copy of a Table with Data

```
# CREATE TABLE TempEmployee as (SELECT EmpId, FirstName, LastName FROM Employee);
```

**ALTER TABLE**

The ALTER command is a DDL command to modify the structure of existing tables in the database by adding, modifying, renaming, or dropping columns and constraints. You can add columns, rename columns, delete columns, or change the data type of columns using the ALTER command.

1.Use ALTER TABLE ADD command to add new columns in the database table.

Syntax:

ALTER TABLE table_name 

ADD column_name1 data_type,

column_name2 data_type,

example:

```
# ALTER TABLE Employee 
ADD(Address VARCHAR2(100),
    City VARCHAR2(25),
    PinCode NUMBER);
```

2.Rename Columns

ALTER TABLE table_name 

RENAME COLUMN old_column_name TO 

new_column_name;

example:


```
# ALTER TABLE Employee 
RENAME COLUMN PinCode TO ZipCode;
```

3.Modify Column Data Type and Size

```
# ALTER TABLE Employee ALTER COLUMN FirstName VARCHAR(50);
```
example:


```
# ALTER TABLE Employee 
ALTER COLUMN FirstName VARCHAR(50);
```

4.Delete Columns from a Table

Syntax:

ALTER TABLE table_name DROP column_name1, 
column_name2...;

example:


```
# ALTER TABLE Employee DROP COLUMN Address;
ALTER TABLE Employee DROP COLUMN Address, City, Pincode; -- deletes multiple columns
```